Конфигурация/DataProcessors/СводноеНачислениеДивидендов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СводноеНачислениеДивидендов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/ДивидендыПоАкциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДивидендыПоАкциям</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерДивидендовНаОднуАкцию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаДивиденды</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Д1</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Д2</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОплатыДивидендов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСобытийПоВыплатеДивидендов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСобытияПоВыплатеДивидендов</Name>
					<Comment>CorpActnEvtId</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/DataProcessors/СводноеНачислениеДивидендов/Forms/ФормаВыбораНачисления/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма.Параметры, "ЦеннаяБумага, Дата");
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДивидендыПоАкциямСрезПоследних.Акция КАК Акция,
	|	ДивидендыПоАкциямСрезПоследних.ДатаФиксации КАК ДатаФиксации,
	|	ДивидендыПоАкциямСрезПоследних.РазмерДивидендовНаОднуАкцию КАК ДивидендыНаЦеннуюБумагу,
	|	ДивидендыПоАкциямСрезПоследних.Д1 КАК Д1,
	|	ДивидендыПоАкциямСрезПоследних.Д2 КАК Д2,
	|	ДивидендыПоАкциямСрезПоследних.ПлановаяДатаОплатыДивидендов КАК ДатаОплатыПлановая,
	|	ДивидендыПоАкциямСрезПоследних.ИдСобытияПоВыплатеДивидендов КАК ИдСобытия,
	|	ДивидендыПоАкциямСрезПоследних.СтатусСобытия КАК СтатусСобытия
	|ИЗ
	|	РегистрСведений.ДивидендыПоАкциям.СрезПоследних(
	|			,
	|			Акция = &Акция
	|				И ДатаФиксации = &ДатаФиксации) КАК ДивидендыПоАкциямСрезПоследних";
	
	Запрос.УстановитьПараметр("Акция", ЭтаФорма.ЦеннаяБумага);
	Запрос.УстановитьПараметр("ДатаФиксации", ЭтаФорма.Дата);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() ЦИкл  
		НовоеНачисление = ЭтаФорма.ПараметрыНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(НовоеНачисление, Выборка);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы Тогда
					
		ЭтаФорма.Закрыть(Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ВозращаемыеДанные(ИсточникДанных)
	
	Результат = Новый Структура("Д1, Д2, ДатаФиксации, ИдСобытия, ДатаОплатыПлановая, ДивидендыНаЦеннуюБумагу, СтатусСобытия");
	ЗаполнитьЗначенияСвойств(Результат, ИсточникДанных);
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура ВыбратьВыплату(Команда)
	
	ТекущиеПараметры = ВозращаемыеДанные(ЭтаФорма.Элементы.ПараметрыНачисления.ТекущиеДанные);
	ЭтаФорма.Закрыть(ТекущиеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.ПараметрыНачисления.Количество()=1 Тогда 
		Отказ = Истина;
		ТекущиеПараметры = ВозращаемыеДанные(ЭтаФорма.ПараметрыНачисления[0]);
		ЭтаФорма.Закрыть(ТекущиеПараметры);
	ИначеЕсли ЭтаФорма.ПараметрыНачисления.Количество()= 0 Тогда
		Отказ = Истина;
		ЭтаФорма.Закрыть(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыНачисленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьВыплату(Команды.Найти("ВыбратьВыплату"));
КонецПроцедуры
